[
    {
        "Tax Document Name": "Form 1040 – U.S. Individual Income Tax Return",
        "Due Date": "April 15 (or next business day if it falls on a weekend or holiday)",
        "Description": "Description: Form 1040 is the main tax form for individual income tax returns. Freelancers file this form to report their annual income, claim deductions, credits, and calculate their final tax liability.\nWhy You Need to Fill Out: All freelancers must file Form 1040 to report their income and calculate the taxes owed to the IRS.\nHow to Fill Out: The form includes sections for personal information, income from various sources, deductions, and credits. Freelancers will need to attach their Schedule C (profit or loss from business) and Schedule SE (self-employment tax).",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f1040.pdf"
    },
    {
        "Tax Document Name": "Schedule C – Profit or Loss From Business",
        "Due Date": "April 15 (or next business day if it falls on a weekend or holiday)",
        "Description": "Description: Schedule C is used to report income and expenses related to your freelance business. It helps determine your net profit or loss for the year.\nWhy You Need to Fill Out: If you’re a freelancer, you must fill out Schedule C to report business income and expenses and calculate your net profit or loss.\nHow to Fill Out: List your business income and expenses, such as supplies, marketing, office space, and any other legitimate business expenses. If your expenses exceed your income, you may report a loss.",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f1040sc.pdf"
    },
    {
        "Tax Document Name": "Schedule SE – Self-Employment Tax",
        "Due Date": "April 15 (or next business day if it falls on a weekend or holiday)",
        "Description": "Description: Schedule SE is used to calculate your self-employment tax, which covers Social Security and Medicare taxes.\nWhy You Need to Fill Out: As a freelancer, you are considered self-employed, meaning you must pay both the employee and employer portions of Social Security and Medicare taxes.\nHow to Fill Out: Schedule SE will calculate your self-employment tax based on your net earnings from Schedule C. The amount is then added to your tax liability on Form 1040.",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f1040sse.pdf"
    },
    {
        "Tax Document Name": "Form 1099-NEC – Nonemployee Compensation",
        "Due Date": "January 31 (for recipients) / February 28 (for paper filing with IRS) or March 31 (if e-filing with IRS)",
        "Description": "Description: Form 1099-NEC reports nonemployee compensation paid to freelancers. It is used by clients to report payments of $600 or more for services rendered.\nWhy You Need to Fill Out: You’ll receive this form from your clients if they paid you $600 or more in a given tax year. You need this to report your income correctly on your Form 1040.\nHow to Fill Out: You do not fill this out as a freelancer. It is issued by your clients. You should ensure you receive the form and use the reported income to complete your tax return.",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f1099nec.pdf"
    },
    {
        "Tax Document Name": "Form 1099-K – Payment Card and Third Party Network Transactions",
        "Due Date": "January 31 (for recipients) / February 28 (for paper filing with IRS) or March 31 (if e-filing with IRS)",
        "Description": "Description: Form 1099-K is issued by payment processors (e.g., PayPal, Stripe) for freelancers who receive over $600 in payments from third-party payment networks.\nWhy You Need to Fill Out: This form reports payments you received through third-party platforms like PayPal or credit card transactions.\nHow to Fill Out: Like Form 1099-NEC, you do not fill this out. The payment processors issue this form. Be sure to keep this form to include in your income tax filing.",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f1099k.pdf"
    },
    {
        "Tax Document Name": "Form 4562 – Depreciation and Amortization",
        "Due Date": "April 15 (or next business day if it falls on a weekend or holiday)",
        "Description": "Description: This form is used to report depreciation and amortization for assets used in your freelance business.\nWhy You Need to Fill Out: If you purchase significant assets like computers, equipment, or vehicles for your freelance business, you can depreciate them over several years to reduce your taxable income.\nHow to Fill Out: You’ll list the assets you purchased, the cost, and the depreciation method you are using (usually straight-line or accelerated).",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f4562.pdf"
    },
    {
        "Tax Document Name": "Form 1040-ES – Estimated Tax for Individuals",
        "Due Date": "April 15, June 15, September 15, January 15 (quarterly)",
        "Description": "Description: Form 1040-ES is used by freelancers to estimate and pay their quarterly taxes.\nWhy You Need to Fill Out: Freelancers do not have taxes automatically withheld from their income like employees. Therefore, you must make estimated tax payments to the IRS each quarter.\nHow to Fill Out: You estimate your tax liability for the year and pay it in quarterly installments using Form 1040-ES. This helps avoid penalties for underpayment.",
        "PDF Link": "https://www.irs.gov/pub/irs-pdf/f1040es.pdf"
    }
]
